{
  "basics": {
    "name": "Prince Paulose",
    "label": "Senior Java Full-Stack Engineer",
    "email": "princepaulose1996@gmail.com",
    "phone": "+91 7591944220",
    "location": "Kerala, India"
  },
  "experience": [
    {
      "company": "IBM India Software Labs",
      "position": "Senior Software Developer",
      "startDate": "May 2024",
      "endDate": "Present",
      "highlights": [
        "Developed and deployed cloud-based Java/Spring Boot SaaS APIs and applications, managing the full software lifecycle from architecture to delivery.",
        "Implemented asynchronous microservices communication using RabbitMQ to ensure high throughput and reliable message delivery between services.",
        "Migrated legacy JavaScript components to modern TypeScript architecture using React Hooks, improving maintainability and performance."
      ]
    },
    {
      "company": "Capgemini",
      "position": "Lead Software Engineer",
      "startDate": "Mar 2023",
      "endDate": "April 2024",
      "highlights": [
        "Led a team of 5 engineers in the development and deployment of enterprise data platforms.",
        "Designed and built an Admin Analytics module that provided real-time operational insights, enhancing decision-making for business stakeholders.",
        "Implemented real-time data migration from MongoDB to Snowflake using Kafka connectors for continuous, reliable data synchronization."
      ]
    },
    {
      "company": "Toobler Technologies",
      "position": "Senior Software Engineer",
      "startDate": "Feb 2019",
      "endDate": "Feb 2023",
      "highlights": [
        "Developed a virtual event management platform from scratch, which successfully onboarded a Fortune 500 client and became a key revenue generator.",
        "Built real-time communication modules including chat, video streaming, and interactive SDK integrations to enhance user engagement and retention."
      ]
    }
  ],
  "projects": [
    {
      "name": "Smart Expense Tracker Platform",
      "description": "Microservices-based expense tracking solution. Features a Spring Boot backend with Authentication and Core services, and a React frontend with Redux Toolkit for state management.",
      "technologies": ["Java", "Spring Boot", "Microservices", "MongoDB", "React", "Redux Toolkit", "Docker"],
      "link": "#",
      "details": {
        "longDescription": "An enterprise-grade financial management platform designed to demonstrate the power and scalability of a microservices architecture. Unlike monolithic expense trackers, this solution decouples authentication, core logic, and analytics into distinct, containerized services. The Authentication Service handles secure JWT issuance and rotation, while the Core Service manages complex transaction CRUD operations. The system employs an Event-Driven architecture where necessary to ensure data consistency. The frontend is a highly responsive React application utilizing Redux Toolkit for efficient caching and optimistic UI updates, providing a seamless user experience similar to native banking apps.",
        "features": [
          "Microservices Architecture: Independent Spring Boot services for Auth and Core logic.",
          "Bank-Grade Security: Stateless JWT authentication with refresh token rotation and BCrypt password hashing.",
          "Optimized Redux State: Normalized state shape with createEntityAdapter for efficient data retrieval.",
          "Docker & Orchestration: Fully containerized services with Docker Compose for one-click local deployment.",
          "Data Analysis Dashboard: Aggregated spending charts and category-wise breakdowns using MongoDB aggregation pipeline.",
          "Swagger/OpenAPI Documentation: Auto-generated API specs for frontend integration."
        ],
        "challenges": [
          "Managing distributed transactions and ensuring eventual consistency across microservices.",
          "Implementing a unified Gateway for request routing and load balancing.",
          "Handling complex state synchronization between the server layout and Redux store.",
          "Optimizing Java memory footprint for running multiple microservices on resource-constrained environments."
        ]
      }
    },
    {
      "name": "Stock Market Signals App",
      "description": "Real-time stock market signal analysis application for Nifty 50. Integrates with TradingView Webhooks to capture data, analyzes it based on custom strategies, and broadcasts signals via Socket.io.",
      "technologies": ["Node.js", "React", "TypeScript", "MongoDB", "Socket.io", "TradingView API"],
      "link": "#",
      "details": {
        "longDescription": "A sophisticated, high-performance personal trading assistant designed to democratize algorithmic trading for the Nifty 50. By bridging TradingView's powerful charting engine with a custom Node.js backend, this application acts as a real-time conduit for market intelligence. It listens for webhook events triggered by complex technical indicators (like RSI divergence, MACD crossovers, and Bollinger Brand breakouts) and processes them instantly. The system filters noise using a custom validation engine that checks for confluence across multiple timeframes, time-of-day constraints, and risk-reward ratios before broadcasting actionable signals. It effectively replaces manual chart watching with an automated, 24/7 market monitor.",
        "features": [
          "Real-time Webhook Ingestion: Sub-millisecond processing of TradingView alerts.",
          "Confluence Validation Engine: filters signals based on multi-factor authentication (e.g., trend direction + volume anomaly).",
          "WebSocket Broadcasting: Instant signal delivery to the React frontend with <50ms latency.",
          "Historical Backtesting Database: MongoDB storage with TTL to analyze signal accuracy over 48-hour rolling windows.",
          "Interactive Dashboard: Live charts, signal history, and audio alerts for incoming trades.",
          "RSI & MACD Divergence Detection logic embedded in the backend."
        ],
        "challenges": [
          "Handling 'Thundering Herd' scenarios where market volatility triggers hundreds of webhooks simultaneously.",
          "Ensuring WebSocket connection stability and auto-reconnection strategies on mobile networks.",
          "Optimizing MongoDB schema for high-write/high-read throughput with automatic data expiration.",
          "Designing a non-blocking architecture in Node.js to ensure calculation heavy tasks don't delay signal propagation."
        ]
      }
    }
  ],
  "skills": {
    "Core Languages": ["Java", "TypeScript", "JavaScript"],
    "Backend / API": ["Spring Boot", "JPA/Hibernate", "Microservices", "Node.js", "Express.js", "REST API", "GraphQL"],
    "Frontend": ["React", "Redux", "Next.js", "Micro front-end", "HTML", "CSS", "Accessibility", "Client-side storage"],
    "Databases": ["MongoDB", "MySQL", "Redis", "Snowflake"],
    "Cloud / DevOps": ["AWS", "Kubernetes", "CI/CD (Git, Jenkins)", "Docker"],
    "Tools / Other": ["Kafka", "Vector Search", "Generative AI", "LLM Integration", "System Design", "Jira"]
  },
  "education": [
    {
      "institution": "University of Calicut",
      "area": "Computer Science and Engineering",
      "studyType": "B.Tech",
      "startDate": "2014",
      "endDate": "2018"
    }
  ],
  "internship": {
    "company": "IPSR solutions Ltd, Cochin",
    "position": "Python/Django Developer Intern",
    "startDate": "Aug 18",
    "endDate": "Jan 19"
  },
  "awards": [
    "Awarded the prestigious 'Going the Extra Mile (GEM)' Award at Capgemini (2024)"
  ],
  "languages": ["English", "Malayalam", "Hindi"],
  "meta": {
    "dob": "9th October 1996"
  }
}
